tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object blockMeshDict;
 version 2.0;
}

vertices
  (

(0 0 0)
(0.499924 -0.0087262 0)
(0.499924 0.0087262 0)
(0 0 2)
(0.499924 -0.0087262 2)
(0.499924 0.0087262 2)
(9.99848 -0.174524 0)
(9.99848 0.174524 0)
(9.99848 -0.174524 2)
(9.99848 0.174524 2)
(0 0 3.1)
(0.499924 -0.0087262 3.1)
(0.499924 0.0087262 3.1)
(0 0 4.1)
(0.499924 -0.0087262 4.1)
(0.499924 0.0087262 4.1)
(0 0 3)
(0.499924 -0.0087262 3)
(0.499924 0.0087262 3)  );

blocks
  (
    hex (0 1 2 0 3 4 5 3) (5 1 18) simpleGrading (0.637016 1.000000 6.252252)
    
    hex (1 6 7 2 4 8 9 5) (26 1 18) simpleGrading (13.610360 1.000000 6.252252)
    
    hex (10 11 12 10 13 14 15 13) (5 1 2) simpleGrading (0.637016 1.000000 1.000000)
    
    hex (3 4 5 3 16 17 18 16) (5 1 6) simpleGrading (0.637016 1.000000 1.000000)
    
  );

edges
  (
    arc 1 2 (0.500000 0 0.000000)
    arc 4 5 (0.500000 0 2.000000)
    arc 6 7 (10.000000 0 0.000000)
    arc 8 9 (10.000000 0 2.000000)
    arc 11 12 (0.500000 0 3.100000)
    arc 14 15 (0.500000 0 4.100000)
    
    arc 17 18 (0.500000 0 3.000000)
    
  );

boundary
  (
    Ambient

    {
      type patch;
      faces
        (
          (6 7 9 8)
        );

    }
    Entrainment

    {
      type patch;
      faces
        (
          (4 5 9 8)
        );

    }
    ImpingedWall

    {
      type wall;
      faces
        (
          (0 1 2 0)
          (1 6 7 2)
        );

    }
    oldInternalFaces

    {
      type patch;
      faces
        (
        );

    }
    Inlet

    {
      type cyclic;
      neighbourPatch Outlet;
      faces
        (
          (13 14 15 13)
        );

    }
    Outlet

    {
      type cyclic;
      neighbourPatch Inlet;
      faces
        (
          (10 11 12 10)
        );

    }
    ExtPipeWall

    {
      type wall;
      faces
        (
          (11 12 15 14)
          (4 5 18 17)
        );

    }
    Wedge1

    {
      type wedge;
      faces
        (
          (0 1 4 3)
          (1 6 8 4)
          (10 11 14 13)
          (3 4 17 16)
        );

    }
    Wedge2

    {
      type wedge;
      faces
        (
          (0 2 5 3)
          (2 7 9 5)
          (10 12 15 13)
          (3 5 18 16)
        );

    }
    Symm

    {
      type symmetryPlane;
      faces
        (
          (0 0 3 3)
          (3 3 16 16)
          (10 10 13 13)
        );

    }
    mappedInlet

    {
      type mappedPatch;
      sampleRegion region0;
      samplePatch none;
      distance 0.5;
      offsetMode normal;
      sampleMode nearestCell;
      faces
        (
          (16 17 18 16)
        );

    }
  );

