tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/0/ImpingedWall/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "1e-05";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type slip;
  }
  ImpingedWall
  {
    type fixedValue;
    value uniform (0 0 0);
  }
  oldInternalFaces
  {
    type zeroFlux;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value nonuniform 0
(
)
;
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    fieldName U;
    setAverage 0;
    average (0 0 0);
    interpolationScheme cell;
    value nonuniform 0
(
)
;
  }
} 	// ************************************************************************* //

