tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class volVectorField;
 format ascii;
 object U;
 version 2.0;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  Ambient
  {
    type zeroGradient;
  }
  Entrainment
  {
    type slip;
    value uniform (0 0 0);
  }
  ImpingedWall
  {
    type slip;
    value uniform (0 0 0);
  }
  oldInternalFaces
  {
    type zeroGradient;
  }
  Inlet
  {
    type cyclic;
  }
  Outlet
  {
    type cyclic;
  }
  ExtPipeWall
  {
    type fixedValue;
    value uniform (0 0 0);
  }
  Wedge1
  {
    type wedge;
  }
  Wedge2
  {
    type wedge;
  }
  Symm
  {
    type symmetryPlane;
  }
  mappedInlet
  {
    type mapped;
    setAverage no;
    average (0 0 0);
    value uniform (0 0 0);
    interpolationScheme cell;
  }
}

