tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/system/fvSchemes
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object fvSchemes;
 version 2.0;
}

ddtSchemes
{
  default steadyState;
}

interpolationSchemes
{
  default linear;
}

snGradSchemes
{
  default corrected;
}

gradSchemes
{
  default Gauss linear ;
}

laplacianSchemes
{
  default Gauss linear corrected ;
}

divSchemes
{
  div(phi,T) bounded Gauss linearUpwind grad(T) ;
  div(phi,U) bounded Gauss linearUpwindV grad(U) ;
  div(phi,p) bounded Gauss linearUpwind grad(p) ;
  div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);
  div(phi,k) bounded Gauss linearUpwind grad(k);
  div((nuEff*dev(T(grad(U))))) Gauss linear;
}

fluxRequired
{
  default no;
  p /* empty */ ;
}

