tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/system/ImpingedWall/sampleDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object sampleDict;
 version 2.0;
}

interpolationScheme cell;

setFormat raw;

surfaceFormat raw;

sets
  (
    free

    {
      type midPoint;
      axis z;
      start (0.005 0 3.1);
      end (0.005 0 4.1);

    }
    across

    {
      type midPoint;
      axis distance;
      start (0.5 0 3.6);
      end (0 0 3.6);

    }
    across3

    {
      type midPoint;
      axis z;
      start (1.5 0 0);
      end (1.5 0 2.0);

    }
    across2

    {
      type midPoint;
      axis z;
      start (1.0 0 0);
      end (1.0 0 2.0);

    }
    across1

    {
      type midPoint;
      axis z;
      start (0.5 0 0);
      end (0.5 0 2.0);

    }
    across001

    {
      type midPoint;
      axis z;
      start (0.005 0 0);
      end (0.005 0 2.0);

    }
    acrossR

    {
      type midPoint;
      axis z;
      start (9.995 0 0);
      end (9.995 0 2.0);

    }
    across03

    {
      type midPoint;
      axis z;
      start (0.166666666667 0 0);
      end (0.166666666667 0 2.0);

    }
  );

surfaces
  (
    ImpingedWall

    {
      type patch;
      patches (ImpingedWall);
      distance 0.0;

    }
    ExtPipeWall

    {
      type patch;
      patches (ExtPipeWall);

    }
    ImpingedWallCell

    {
      type patchInternalField;
      patches (ImpingedWall);
      distance 0.0;

    }
    ExtPipeWallCell

    {
      type patchInternalField;
      patches (ExtPipeWall);
      distance 0.0;

    }
  );

fields
  (
    T
    U
    p
    Ux
    epsilon
    nut
    k
    wallShearStress
  );

