tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/system/refineMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object refineMeshDict;
 version 2.0;
}

set paraNextExtPipeWall;

coordinateSystem global;

globalCoeffs
{
  tan1 (0.0349048 0.0 0.0);
  tan2 (0 1 0);
}

directions
  (
    tan1
  );

useHexTopology yes;
geometricCut no;
writeMesh no;
