tutorials/heatTransfer/heatSimpleFoam/ImpJet-UMI/system/topoSetDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 class dictionary;
 format ascii;
 object topoSetDict;
 version 2.0;
}

actions
  (

    {
      action new;
      name pipeCells;
      source cylinderToCell;
      sourceInfo
      {
        p1 (0 0 3.0);
        p2 (0 0 5.1);
        radius 0.5;
      }
      type cellSet;

    }
  );

